#include "E:\DMPT\Laboratory_Practice\Core\Inc\init.h"
void GPIO_init(void)
{
*(uint32_t *)(0x40023800UL + 0x30UL) |= 0x1; //Включение тактирования для порта A
*(uint32_t *)(0x40020000UL + 0x00UL) |= 0x400; //Настройка работы порта PA5 на Output
*(uint32_t *)(0x40020000UL + 0x04UL) |= 0x00; // Отключение Push-Pull регистра 5-го пина А
*(uint32_t *)(0x40020000UL + 0x08UL) |= 0x400; //Настройка скорости работы 5-го пина GPIOA на среднюю
*(uint32_t *)(0x40020000UL + 0x0CUL) |= 0x00; //Отключение PU/PD резистора для 5-го пина 

*(uint32_t *)(0x40020000UL + 0x00UL) |= 0x1; //Настройка работы порта PA0 на Output
*(uint32_t *)(0x40020000UL + 0x04UL) |= 0x00; // Отключение Push-Pull регистра 0-го пина А
*(uint32_t *)(0x40020000UL + 0x08UL) |= 0x1; //Настройка скорости работы 0-го пина GPIOA на среднюю
*(uint32_t *)(0x40020000UL + 0x0CUL) |= 0x00; //Отключение PU/PD резистора для 0-го пина A


SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_GPIOBEN); // Включение тактирования для прота B
SET_BIT(GPIOB->MODER, GPIO_MODER_MODER0_0); //Настройка работы порта PB0 в режим работы на Output
CLEAR_BIT(GPIOB->OTYPER, GPIO_OTYPER_OT0); // Отключение Push-Pull регистра 0-го пина B 
SET_BIT(GPIOB->OSPEEDR, GPIO_OSPEEDER_OSPEEDR0_0);//Настройка скорости работы 0-го пина GPIOB на среднюю
CLEAR_BIT(GPIOB->PUPDR, GPIO_PUPDR_PUPD0); //Отключение PU/PD резистора для 0-го пина B

*(uint32_t *)(0x40020400UL + 0x00UL) |= 0x4; //Настройка работы порта PB1 на Output
*(uint32_t *)(0x40020400UL + 0x04UL) |= 0x00; // Отключение Push-Pull работы 1-го пина B
*(uint32_t *)(0x40020400UL + 0x08UL) |= 0x4; //Настройка скорости работы 1-го пина GPIOB на среднюю
*(uint32_t *)(0x40020400UL + 0x0CUL) |= 0x00; //Отключение PU/PD резистора для 1-го пина B

*(uint32_t *)(0x40020800UL + 0x00UL) |= 0x1000; //Настройка работы порта PС6 на Output
*(uint32_t *)(0x40020800UL + 0x04UL) |= 0x00; // Отключение Push-Pull регистра 6-го пина С
*(uint32_t *)(0x40020800UL + 0x08UL) |= 0x1000; //Настройка скорости работы 6-го пина GPIOС на среднюю
*(uint32_t *)(0x40020800UL + 0x0CUL) |= 0x00; //Отключение PU/PD резистора для 6-го пина С

RCC_GPIOС_TAKT |= RCC_GPIOC_TAKT_EN; //Включение тактирования для порта C
GPIOC_MODE |= GPIOC8_MODE_OUTPUT; //Настройка режима работы порта PC8 на Output
GPIOC8_PUSH_PULL_WORKING_MODE |= OFF; //Отключение Push-Pull регистра 8-го пина C
GPIOC8_SPEED |= GPIOC8_SPEED_MIDDLE; // Настройка скорости работы 8-го пина GPIOC на среднюю
GPIOС8_PUSH_PULL_OFF |= OFF; //Отключение PU/PD резистора для для 8-го пина C
}
void GLAV_ZADANIE(uint8_t *led, uint8_t *un_led, uint8_t *button)
{
            if ( ((*(uint32_t *)(0x40020800UL + 0x10UL) & 0x2000UL) == 0) )// Проверка была ли нажата первая кнопка (она инвертированная)
        {
            if (*button == 0)// Если 3 кнопка не нажата, то
        {
            for (uint32_t i=0; i<1000000 ; i++){} //Задержка для уменьшения дребезга
            (*led)++;//Увеличение счётчика зажигаемых светодиодов
        }
        else if (*button == 1)//Если 3 кнопка нажата, то
        {
            for (uint32_t i=0; i<1000000 ; i++){} //Задержка для уменьшения дребзга
            (*un_led)++;//Увеличение счётчика гасимых светодиодов
        }
        if (*led > 6) *led = 6;//Условие того, чтобы счётчик зажигаемых светодиодов не превысил количество светодиодов
        }
        if ((*led == 1) && (*un_led == 0)) { *(uint32_t *)(0x40020000UL + 0x18UL) |= 0x20; }// Если должен гореть первый светодиод и кнопка для затухания светодиодов не была нажата, то зажечь первый светодиод
        if ((*led == 2) && (*un_led == 0)) { *(uint32_t *)(0x40020000UL + 0x18UL) |= 0x1; }// Если должен гореть второй светодиод и кнопка для затухания светодиодов не была нажата, то зажечь второй светодиод
        if ((*led == 3) && (*un_led == 0)) { *(uint32_t *)(0x40020400UL + 0x18UL) |= 0x1; }// Если должен гореть третий светодиод и кнопка для затухания светодиодов не была нажата, то зажечь третий светодиод
        if ((*led == 4) && (*un_led == 0)) { *(uint32_t *)(0x40020400UL + 0x18UL) |= 0x2; }// Если должен гореть четвёртый светодиод и кнопка для затухания светодиодов не была нажата, то зажечь четвёртый светодиод
        if ((*led == 5) && (*un_led == 0)) { *(uint32_t *)(0x40020800UL + 0x18UL) |= 0x100; }// Если должен гореть пятый светодиод и кнопка для затухания светодиодов не была нажата, то зажечь пятый светодиод
        if ((*led == 6) && (*un_led == 0)) { *(uint32_t *)(0x40020800UL + 0x18UL) |= 0x40; }// Если должен гореть шестой светодиод и кнопка для затухания светодиодов не была нажата, то зажечь шестой светодиод
        if ( ((*(uint32_t *)(0x40020800UL + 0x10UL) & 0x1000UL) != 0) )// Проверка была ли нажата вторая кнопка
        {
        if (*button == 0)// Если 3 кнопка не нажата, то
        {
            for (uint32_t i=0; i<1000000 ; i++){}// Задержка для уменьшения дребезга
            (*un_led)++;// Увеличение счётчика гасимых светодиодов
        }
        else if (*button == 1)// Если 3 кнопка нажата, то 
        {
        for (uint32_t i=0; i<1000000 ; i++){}// Задержка для уменьшения дребезга
            (*led)++;//Увеличение счётчика зажигаемых светодиодов
        }
        }
        if (*un_led != 0)// Если счётчик гасимых светодиодов увеличился, то 
        {
            if (*led == 6)// Если горит шестой светодиод
            {*(uint32_t *)(0x40020800UL + 0x18UL) |= 0x400000; *led = 5;}// Выключить шестой светодиод и установить новое значение счётчика горящих светодиодов
            else if (*led == 5) // Иначе если горит пятый светодиод
            {*(uint32_t *)(0x40020800UL + 0x18UL) |= 0x1000000; *led = 4;}// Выключить пятый светодиод и установить новое значение счётчика горящих светодиодов
            else if (*led == 4) //Иначе если горит четвертый светодиод
            { *(uint32_t *)(0x40020400UL + 0x18UL) |= 0x20000; *led = 3; }// Выключить четвертый светодиод и установить новое значение счётчика горящих светодиодов
            else if (*led == 3) //Иначе если горит третий светодиод
            { *(uint32_t *)(0x40020400UL + 0x18UL) |= 0x10000; *led = 2; }// Выключить третий светодиод и установить новое значение счётчика горящих светодиодов
            else if (*led == 2) //Иначе если горит второй светодиод
            { *(uint32_t *)(0x40020000UL + 0x18UL) |= 0x10000; *led = 1; }// Выключить второй светодиод и установить новое значение счётчика горящих светодиодов
            else if (*led == 1) //Иначе если горит первый светодиод
            { *(uint32_t *)(0x40020000UL + 0x18UL) |= 0x200000; *led = 0; }// Выключить первый светодиод и занулить счётчик горящих светодиодов
            *un_led = 0;// Зануление счётчика гасимых светодиодов для продолжения цикла при необходимости
        }
        if( ((*(uint32_t *)(0x40020800UL + 0x10UL) & 0x400UL) != 0) && (*button == 0) )//Проверка была ли нажата третья кнопка и режима работы первых двух кнопок
        {
            for (uint32_t i=0; i<1000000 ; i++){} // Задержка для уменьшения дребезга
            *button = 1; // Установка нового значения переменной этой кнопки для инвертирования работы других кнопок 
        } 
        else if( ((*(uint32_t *)(0x40020800UL + 0x10UL) & 0x400UL) != 0) && (*button == 1) )//Проверка была ли нажата третья кнопка и находятся ли отсавшиеся кнопки в инвертированном режиме работы
        {
            for (uint32_t i=0; i<1000000 ; i++){} // Задержка для уменьшения дребезга
            *button = 0;// Сброс режима работы первых давух кнопок на стандартный
        }  
}
void DOP_ZADANIE(uint8_t *led, uint8_t *un_led, uint8_t *press)
{
    if ( ((*(uint32_t *)(0x40020800UL + 0x10UL) & 0x2000UL) == 0) )
        {
            for (uint32_t i=0; i<1000000 ; i++){}
        (*led)++;
            if (*led > 6) 
            {
                *led = 1;
                *(uint32_t *)(0x40020800UL + 0x18UL) = 0x400000; //PC6 OFF
                *(uint32_t *)(0x40020800UL + 0x18UL) = 0x1000000; //PC8 OFF
                *(uint32_t *)(0x40020400UL + 0x18UL) = 0x20000;   //PB1 OFF
                *(uint32_t *)(0x40020400UL + 0x18UL) = 0x10000;   //PB0 OFF
                *(uint32_t *)(0x40020000UL + 0x18UL) = 0x10000;   //PA0 OFF
                *(uint32_t *)(0x40020000UL + 0x18UL) = 0x200000;  //PA5 OFF
                *un_led = 0;
            }
            if ((*led >= 1) && (*un_led == 0)) { *(uint32_t *)(0x40020000UL + 0x18UL) = 0x20; }    //PA5 ON
            if ((*led >= 2) && (*un_led == 0)) { *(uint32_t *)(0x40020000UL + 0x18UL) = 0x1; }     //PA0 ON
            if ((*led >= 3) && (*un_led == 0)) { *(uint32_t *)(0x40020400UL + 0x18UL) = 0x1; }     //PB0 ON
            if ((*led >= 4) && (*un_led == 0)) { *(uint32_t *)(0x40020400UL + 0x18UL) = 0x2; }     //PB1 ON
            if ((*led >= 5) && (*un_led == 0)) { *(uint32_t *)(0x40020800UL + 0x18UL) = 0x100; }   //PC8 ON
            if ((*led >= 6) && (*un_led == 0)) { *(uint32_t *)(0x40020800UL + 0x18UL) = 0x40; }    //PC6 ON
        }

if ( ((*(uint32_t *)(0x40020800UL + 0x10UL) & 0x1000UL) != 0) )
        {
            for (uint32_t i=0; i<1000000 ; i++){}
            if (*led == 0)
            {
                *(uint32_t *)(0x40020000UL + 0x18UL) = 0x20;   //PA5 ON
                *(uint32_t *)(0x40020000UL + 0x18UL) = 0x1;    //PA0 ON
                *(uint32_t *)(0x40020400UL + 0x18UL) = 0x1;    //PB0 ON
                *(uint32_t *)(0x40020400UL + 0x18UL) = 0x2;    //PB1 ON
                *(uint32_t *)(0x40020800UL + 0x18UL) = 0x100;  //PC8 ON
                *led = 5;
            }
            else
            {
                if (*led == 6) { *(uint32_t *)(0x40020800UL + 0x18UL) = 0x400000; *led = 5; }        //PC6 OFF
                else if (*led == 5) { *(uint32_t *)(0x40020800UL + 0x18UL) = 0x1000000; *led = 4; }  //PC8 OFF
                else if (*led == 4) { *(uint32_t *)(0x40020400UL + 0x18UL) = 0x20000; *led = 3; }    //PB1 OFF
                else if (*led == 3) { *(uint32_t *)(0x40020400UL + 0x18UL) = 0x10000; *led = 2; }    //PB0 OFF
                else if (*led == 2) { *(uint32_t *)(0x40020000UL + 0x18UL) = 0x10000; *led = 1; }    //PA0 OFF
                else if (*led == 1) { *(uint32_t *)(0x40020000UL + 0x18UL) = 0x200000; *led = 0; }   //PA5 OFF
            }
        }

if ( ((*(uint32_t *)(0x40020800UL + 0x10UL) & 0x400UL) != 0) )
{
    for (uint32_t i=0; i<1000000 ; i++){}
    (*press)++;
    if (*press > 3) *press = 0;
}
if ((*led == 1) && (*press == 1))
{
    *(uint32_t *)(0x40020000UL + 0x18UL) = 0x200000;
    for (uint32_t i = 0; i<200000;i++){}        
    *(uint32_t *)(0x40020000UL + 0x18UL) = 0x20;
    for (uint32_t i = 0; i<200000;i++){}
}
if ((*led == 1) && (*press == 2))
{
    *(uint32_t *)(0x40020000UL + 0x18UL) = 0x200000;
    for (uint32_t i = 0; i<150000;i++){}        
    *(uint32_t *)(0x40020000UL + 0x18UL) = 0x20;
    for (uint32_t i = 0; i<150000;i++){}
}
if ((*led == 1) && (*press == 3))
{
    *(uint32_t *)(0x40020000UL + 0x18UL) = 0x200000;
    for (uint32_t i = 0; i<100000;i++){}        
    *(uint32_t *)(0x40020000UL + 0x18UL) = 0x20;
    for (uint32_t i = 0; i<100000;i++){}
}
if ((*led == 2) && (*press == 1))
{
    *(uint32_t *)(0x40020000UL + 0x18UL) = 0x10000;
    for (uint32_t i = 0; i<200000;i++){}        
    *(uint32_t *)(0x40020000UL + 0x18UL) = 0x1;
    for (uint32_t i = 0; i<200000;i++){}
}
if ((*led == 2) && (*press == 2))
{
    *(uint32_t *)(0x40020000UL + 0x18UL) = 0x10000;
    for (uint32_t i = 0; i<150000;i++){}        
    *(uint32_t *)(0x40020000UL + 0x18UL) = 0x1;
    for (uint32_t i = 0; i<150000;i++){}
}
if ((*led == 2) && (*press == 3))
{
    *(uint32_t *)(0x40020000UL + 0x18UL) = 0x10000;
    for (uint32_t i = 0; i<100000;i++){}        
    *(uint32_t *)(0x40020000UL + 0x18UL) = 0x1;
    for (uint32_t i = 0; i<100000;i++){}
}
if ((*led == 3) && (*press == 1))
{
    *(uint32_t *)(0x40020400UL + 0x18UL) = 0x10000;
    for (uint32_t i = 0; i<200000;i++){}        
    *(uint32_t *)(0x40020400UL + 0x18UL) = 0x1;
    for (uint32_t i = 0; i<200000;i++){}
}
if ((*led == 3) && (*press == 2))
{
    *(uint32_t *)(0x40020400UL + 0x18UL) = 0x10000;
    for (uint32_t i = 0; i<150000;i++){}        
    *(uint32_t *)(0x40020400UL + 0x18UL) = 0x1;
    for (uint32_t i = 0; i<150000;i++){}
}
if ((*led == 3) && (*press == 3))
{
    *(uint32_t *)(0x40020400UL + 0x18UL) = 0x10000;
    for (uint32_t i = 0; i<100000;i++){}        
    *(uint32_t *)(0x40020400UL + 0x18UL) = 0x1;
    for (uint32_t i = 0; i<100000;i++){}
}
if ((*led == 4) && (*press == 1))
{
    *(uint32_t *)(0x40020400UL + 0x18UL) = 0x20000;
    for (uint32_t i = 0; i<200000;i++){}        
    *(uint32_t *)(0x40020400UL + 0x18UL) = 0x2;
    for (uint32_t i = 0; i<200000;i++){}
}
if ((*led == 4) && (*press == 2))
{
    *(uint32_t *)(0x40020400UL + 0x18UL) = 0x20000;
    for (uint32_t i = 0; i<150000;i++){}        
    *(uint32_t *)(0x40020400UL + 0x18UL) = 0x2;
    for (uint32_t i = 0; i<150000;i++){}
}
if ((*led == 4) && (*press == 3))
{
    *(uint32_t *)(0x40020400UL + 0x18UL) = 0x20000;
    for (uint32_t i = 0; i<100000;i++){}        
    *(uint32_t *)(0x40020400UL + 0x18UL) = 0x2;
    for (uint32_t i = 0; i<100000;i++){}
}
if ((*led == 5) && (*press == 1))
{
   *(uint32_t *)(0x40020800UL + 0x18UL) = 0x1000000;
    for (uint32_t i = 0; i<200000;i++){}        
    *(uint32_t *)(0x40020800UL + 0x18UL) = 0x100;
    for (uint32_t i = 0; i<200000;i++){}
}
if ((*led == 5) && (*press == 2))
{
   *(uint32_t *)(0x40020800UL + 0x18UL) = 0x1000000;
    for (uint32_t i = 0; i<150000;i++){}        
    *(uint32_t *)(0x40020800UL + 0x18UL) = 0x100;
    for (uint32_t i = 0; i<150000;i++){}
}
if ((*led == 5) && (*press == 3))
{
   *(uint32_t *)(0x40020800UL + 0x18UL) = 0x1000000;
    for (uint32_t i = 0; i<100000;i++){}        
    *(uint32_t *)(0x40020800UL + 0x18UL) = 0x100;
    for (uint32_t i = 0; i<100000;i++){}
}
if ((*led == 6) && (*press == 1))
{
   *(uint32_t *)(0x40020800UL + 0x18UL) = 0x400000;
    for (uint32_t i = 0; i<200000;i++){}        
    *(uint32_t *)(0x40020800UL + 0x18UL) = 0x40;
    for (uint32_t i = 0; i<200000;i++){}
}
if ((*led == 6) && (*press == 2))
{
   *(uint32_t *)(0x40020800UL + 0x18UL) = 0x400000;
    for (uint32_t i = 0; i<150000;i++){}        
    *(uint32_t *)(0x40020800UL + 0x18UL) = 0x40;
    for (uint32_t i = 0; i<150000;i++){}
}
if ((*led == 6) && (*press == 3))
{
   *(uint32_t *)(0x40020800UL + 0x18UL) = 0x400000;
    for (uint32_t i = 0; i<100000;i++){}        
    *(uint32_t *)(0x40020800UL + 0x18UL) = 0x40;
    for (uint32_t i = 0; i<100000;i++){}
}
}
