#include "E:\DMPT\Laboratory_Practice\Core\Inc\init.h"
void GPIO_init(void)
{
*(uint32_t *)(0x40023800UL + 0x30UL) |= 0x1; //Включение тактирования для порта A
*(uint32_t *)(0x40020000UL + 0x00UL) |= 0x400; //Настройка работы порта PA5 на Output
*(uint32_t *)(0x40020000UL + 0x04UL) |= 0x00; // Отключение Push-Pull регистра 5-го пина А
*(uint32_t *)(0x40020000UL + 0x08UL) |= 0x400; //Настройка скорости работы 5-го пина GPIOA на среднюю
*(uint32_t *)(0x40020000UL + 0x0CUL) |= 0x00; //Отключение PU/PD резистора для 5-го пина 

*(uint32_t *)(0x40020000UL + 0x00UL) |= 0x1; //Настройка работы порта PA0 на Output
*(uint32_t *)(0x40020000UL + 0x04UL) |= 0x00; // Отключение Push-Pull регистра 0-го пина А
*(uint32_t *)(0x40020000UL + 0x08UL) |= 0x1; //Настройка скорости работы 0-го пина GPIOA на среднюю
*(uint32_t *)(0x40020000UL + 0x0CUL) |= 0x00; //Отключение PU/PD резистора для 0-го пина A


SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_GPIOBEN); // Включение тактирования для прота B
SET_BIT(GPIOB->MODER, GPIO_MODER_MODER0_0); //Настройка работы порта PB0 в режим работы на Output
CLEAR_BIT(GPIOB->OTYPER, GPIO_OTYPER_OT0); // Отключение Push-Pull регистра 0-го пина B 
SET_BIT(GPIOB->OSPEEDR, GPIO_OSPEEDER_OSPEEDR0_0);//Настройка скорости работы 0-го пина GPIOB на среднюю
CLEAR_BIT(GPIOB->PUPDR, GPIO_PUPDR_PUPD0); //Отключение PU/PD резистора для 0-го пина B

*(uint32_t *)(0x40020400UL + 0x00UL) |= 0x4; //Настройка работы порта PB1 на Output
*(uint32_t *)(0x40020400UL + 0x04UL) |= 0x00; // Отключение Push-Pull работы 1-го пина B
*(uint32_t *)(0x40020400UL + 0x08UL) |= 0x4; //Настройка скорости работы 1-го пина GPIOB на среднюю
*(uint32_t *)(0x40020400UL + 0x0CUL) |= 0x00; //Отключение PU/PD резистора для 1-го пина B

*(uint32_t *)(0x40020800UL + 0x00UL) |= 0x1000; //Настройка работы порта PС6 на Output
*(uint32_t *)(0x40020800UL + 0x04UL) |= 0x00; // Отключение Push-Pull регистра 6-го пина С
*(uint32_t *)(0x40020800UL + 0x08UL) |= 0x1000; //Настройка скорости работы 6-го пина GPIOС на среднюю
*(uint32_t *)(0x40020800UL + 0x0CUL) |= 0x00; //Отключение PU/PD резистора для 6-го пина С

RCC_GPIOС_TAKT |= RCC_GPIOC_TAKT_EN; //Включение тактирования для порта C
GPIOC_MODE |= GPIOC8_MODE_OUTPUT; //Настройка режима работы порта PC8 на Output
GPIOC8_PUSH_PULL_WORKING_MODE |= OFF; //Отключение Push-Pull регистра 8-го пина C
GPIOC8_SPEED |= GPIOC8_SPEED_MIDDLE; // Настройка скорости работы 8-го пина GPIOC на среднюю
GPIOС8_PUSH_PULL_OFF |= OFF; //Отключение PU/PD резистора для для 8-го пина C
}
void GLAV_ZADANIE(uint8_t *led, volatile bool *un_led, volatile bool *button)
{
            if ( ((*(uint32_t *)(0x40020800UL + 0x10UL) & 0x2000UL) == 0) )// Проверка была ли нажата первая кнопка (она инвертированная)
        {
            if (*button == 0)// Если 3 кнопка не нажата, то
        {
            for (uint32_t i=0; i<1000000 ; i++){} //Задержка для уменьшения дребезга
            (*led)++;//Увеличение счётчика зажигаемых светодиодов
        }
        else if (*button == 1)//Если 3 кнопка нажата, то
        {
            for (uint32_t i=0; i<1000000 ; i++){} //Задержка для уменьшения дребзга
            (*un_led) = 1;//Смена значения маркера для гащения светодиодовв
        }
        if (*led > 6) *led = 6;//Условие того, чтобы счётчик зажигаемых светодиодов не превысил количество светодиодов
        }
        if ((*led == 1) && (*un_led == 0)) { *(uint32_t *)(0x40020000UL + 0x18UL) |= 0x20; }// Если должен гореть первый светодиод и кнопка для затухания светодиодов не была нажата, то зажечь первый светодиод подключенный к PA5
        if ((*led == 2) && (*un_led == 0)) { *(uint32_t *)(0x40020000UL + 0x18UL) |= 0x1; }// Если должен гореть второй светодиод и кнопка для затухания светодиодов не была нажата, то зажечь второй светодиод подключенный к PA0
        if ((*led == 3) && (*un_led == 0)) { *(uint32_t *)(0x40020400UL + 0x18UL) |= 0x1; }// Если должен гореть третий светодиод и кнопка для затухания светодиодов не была нажата, то зажечь третий светодиод подключенный к PB0
        if ((*led == 4) && (*un_led == 0)) { *(uint32_t *)(0x40020400UL + 0x18UL) |= 0x2; }// Если должен гореть четвёртый светодиод и кнопка для затухания светодиодов не была нажата, то зажечь четвёртый светодиод подключенный к PB1
        if ((*led == 5) && (*un_led == 0)) { *(uint32_t *)(0x40020800UL + 0x18UL) |= 0x100; }// Если должен гореть пятый светодиод и кнопка для затухания светодиодов не была нажата, то зажечь пятый светодиод подключенный к PC8
        if ((*led == 6) && (*un_led == 0)) { *(uint32_t *)(0x40020800UL + 0x18UL) |= 0x40; }// Если должен гореть шестой светодиод и кнопка для затухания светодиодов не была нажата, то зажечь шестой светодиод подключенный к PC6
        if ( ((*(uint32_t *)(0x40020800UL + 0x10UL) & 0x1000UL) != 0) )// Проверка была ли нажата вторая кнопка
        {
        if (*button == 0)// Если 3 кнопка не нажата, то
        {
            for (uint32_t i=0; i<1000000 ; i++){}// Задержка для уменьшения дребезга
            (*un_led) = 1;// Смена значения маркера для гащения светодиодов
        }
        else if (*button == 1)// Если 3 кнопка нажата, то 
        {
        for (uint32_t i=0; i<1000000 ; i++){}// Задержка для уменьшения дребезга
            (*led)++;//Увеличение счётчика зажигаемых светодиодов
        }
        }
        if (*un_led != 0)// Если счётчик гасимых светодиодов увеличился, вследствии нажатия на вторую кнопку, то 
        {
            if (*led == 6)// Если горит шестой светодиод
            {*(uint32_t *)(0x40020800UL + 0x18UL) |= 0x400000; *led = 5;}// Выключить шестой светодиод подключенный к PC6 и установить новое значение счётчика горящих светодиодов
            else if (*led == 5) // Иначе если горит пятый светодиод
            {*(uint32_t *)(0x40020800UL + 0x18UL) |= 0x1000000; *led = 4;}// Выключить пятый светодиод подключенный к PC8 и установить новое значение счётчика горящих светодиодов
            else if (*led == 4) //Иначе если горит четвертый светодиод
            { *(uint32_t *)(0x40020400UL + 0x18UL) |= 0x20000; *led = 3; }// Выключить четвертый светодиод подключенный к PB1 и установить новое значение счётчика горящих светодиодов
            else if (*led == 3) //Иначе если горит третий светодиод
            { *(uint32_t *)(0x40020400UL + 0x18UL) |= 0x10000; *led = 2; }// Выключить третий светодиод подключенный к PB0 и установить новое значение счётчика горящих светодиодов
            else if (*led == 2) //Иначе если горит второй светодиод
            { *(uint32_t *)(0x40020000UL + 0x18UL) |= 0x10000; *led = 1; }// Выключить второй светодиод подключенный к PA0 и установить новое значение счётчика горящих светодиодов
            else if (*led == 1) //Иначе если горит первый светодиод
            { *(uint32_t *)(0x40020000UL + 0x18UL) |= 0x200000; *led = 0; }// Выключить первый светодиод подключенный к PA5 и занулить счётчик горящих светодиодов
            *un_led = 0;// Зануление счётчика гасимых светодиодов для продолжения цикла при необходимости
        }
        if( ((*(uint32_t *)(0x40020800UL + 0x10UL) & 0x400UL) != 0) && (*button == 0) )//Проверка была ли нажата третья кнопка и режима работы первых двух кнопок
        {
            for (uint32_t i=0; i<1000000 ; i++){} // Задержка для уменьшения дребезга
            *button = 1; // Установка нового значения переменной этой кнопки для инвертирования работы других кнопок 
        } 
        else if( ((*(uint32_t *)(0x40020800UL + 0x10UL) & 0x400UL) != 0) && (*button == 1) )//Проверка была ли нажата третья кнопка и находятся ли отсавшиеся кнопки в инвертированном режиме работы
        {
            for (uint32_t i=0; i<1000000 ; i++){} // Задержка для уменьшения дребезга
            *button = 0;// Сброс режима работы первых давух кнопок на стандартный
        }  
}
void DOP_ZADANIE(uint8_t *led, volatile bool *un_led, uint8_t *press)
{
    if ( ((*(uint32_t *)(0x40020800UL + 0x10UL) & 0x2000UL) == 0) )//Проверка была ли нажата первая кнопка (она инвертирована)
        {
            for (uint32_t i=0; i<1000000 ; i++){} // Задержка для уменьшения дребезга
        (*led)++; // Увеличение счётчика горящих светодиодов
            if (*led > 6) // Если счётчик горящих светодиодов превышает количесто светодиодов 
            {
                *led = 1;//Установка значения счётчика, чтобы горел только первый светодиод подключенный к PA5
                *(uint32_t *)(0x40020800UL + 0x18UL) = 0x400000; //Отключение светодиода подключенного к PC6
                *(uint32_t *)(0x40020800UL + 0x18UL) = 0x1000000; //Отключение светодиода подключенного к PC8
                *(uint32_t *)(0x40020400UL + 0x18UL) = 0x20000;   //Отключение светодиода подключенного к PB1
                *(uint32_t *)(0x40020400UL + 0x18UL) = 0x10000;   //Отключение светодиода подключенного к PB0
                *(uint32_t *)(0x40020000UL + 0x18UL) = 0x10000;   //Отключение светодиода подключенного к PA0
                *(uint32_t *)(0x40020000UL + 0x18UL) = 0x200000;  //Отключение светодиода подключенного к PA5
                *un_led = 0; //Зануление маркера затухаемых светодиодов
            }
            if ((*led >= 1) && (*un_led == 0)) { *(uint32_t *)(0x40020000UL + 0x18UL) = 0x20; }    // Если первая кнопка была нажата 1 или более раз и при этом кнопка для затухания светодиодов не была тронута, то зажечь светодиод подключенный к PA5
            if ((*led >= 2) && (*un_led == 0)) { *(uint32_t *)(0x40020000UL + 0x18UL) = 0x1; }     // Если первая кнопка была нажата 2 или более раз и при этом кнопка для затухания светодиодов не была тронута, то зажечь светодиод подключенный к PA0
            if ((*led >= 3) && (*un_led == 0)) { *(uint32_t *)(0x40020400UL + 0x18UL) = 0x1; }     // Если первая кнопка была нажата 3 или более раз и при этом кнопка для затухания светодиодов не была тронута, то зажечь светодиод подключенный к PB0
            if ((*led >= 4) && (*un_led == 0)) { *(uint32_t *)(0x40020400UL + 0x18UL) = 0x2; }     // Если первая кнопка была нажата 4 или более раз и при этом кнопка для затухания светодиодов не была тронута, то зажечь светодиод подключенный к PB1
            if ((*led >= 5) && (*un_led == 0)) { *(uint32_t *)(0x40020800UL + 0x18UL) = 0x100; }   // Если первая кнопка была нажата 5 или более раз и при этом кнопка для затухания светодиодов не была тронута, то зажечь светодиод подключенный к PC8
            if ((*led >= 6) && (*un_led == 0)) { *(uint32_t *)(0x40020800UL + 0x18UL) = 0x40; }    // Если первая кнопка была нажата 3 или более раз и при этом кнопка для затухания светодиодов не была тронута, то зажечь светодиод подключенный к PC6
        }

if ( ((*(uint32_t *)(0x40020800UL + 0x10UL) & 0x1000UL) != 0) ) // Проверка была ли нажата вторая кнопка
        {
            for (uint32_t i=0; i<1000000 ; i++){} // Задержка для уменьшения дребзга
            (*un_led) = 1;// Смена значения маркера для гащения светодиодов
            if (*un_led != 0)// Если маркер гасимых светодиодов был изменен, вследствии нажатия на вторую кнопку, то 
            {
            if (*led == 6)// Если горит шестой светодиод
            {*(uint32_t *)(0x40020800UL + 0x18UL) |= 0x400000; *led = 5;}// Выключить шестой светодиод подключенный к PC6 и установить новое значение счётчика горящих светодиодов
            else if (*led == 5) // Иначе если горит пятый светодиод
            {*(uint32_t *)(0x40020800UL + 0x18UL) |= 0x1000000; *led = 4;}// Выключить пятый светодиод подключенный к PC8 и установить новое значение счётчика горящих светодиодов
            else if (*led == 4) //Иначе если горит четвертый светодиод
            { *(uint32_t *)(0x40020400UL + 0x18UL) |= 0x20000; *led = 3; }// Выключить четвертый светодиод подключенный к PB1 и установить новое значение счётчика горящих светодиодов
            else if (*led == 3) //Иначе если горит третий светодиод
            { *(uint32_t *)(0x40020400UL + 0x18UL) |= 0x10000; *led = 2; }// Выключить третий светодиод подключенный к PB0 и установить новое значение счётчика горящих светодиодов
            else if (*led == 2) //Иначе если горит второй светодиод
            { *(uint32_t *)(0x40020000UL + 0x18UL) |= 0x10000; *led = 1; }// Выключить второй светодиод подключенный к PA0 и установить новое значение счётчика горящих светодиодов
            else if (*led == 1) //Иначе если горит первый светодиод
            { *(uint32_t *)(0x40020000UL + 0x18UL) |= 0x200000; *led = 0; }// Выключить первый светодиод подключенный к PA5 и занулить счётчик горящих светодиодов
            else if (*led == 0) // Иначе если все светодиоды потухли
            {
                *(uint32_t *)(0x40020000UL + 0x18UL) = 0x20;//Включить первый светодиод подключенный к PA5
                *(uint32_t *)(0x40020000UL + 0x18UL) = 0x1;//Включить второй светодиод подключенный к PA0
                *(uint32_t *)(0x40020400UL + 0x18UL) = 0x1;//Включить третий светодиод подключенный к PB0
                *(uint32_t *)(0x40020400UL + 0x18UL) = 0x2;//Включить четвертый светодиод подключенный к PB1
                *(uint32_t *)(0x40020800UL + 0x18UL) = 0x100;//Включить пятый светодиод подключенный к PC8
                *led = 5;//Установить значения счётчика для пяти горящих светодиодов
            }
            *un_led = 0;// Сброс маркера гасимых светодиодов для продолжения цикла при необходимости
            }
        }
if ( ((*(uint32_t *)(0x40020800UL + 0x10UL) & 0x400UL) != 0) )// Проверка была ли нажата третья кнопка
{
    for (uint32_t i=0; i<1000000 ; i++){}//Задержка для уменьшения дребезга
    (*press)++;//Увеличение счётчика нажатий на третью кнопку для смены режимов мерцания светодиода
    if (*press > 3) *press = 0;//Если счётчик выходит за пределы количества режимов мерцания, то он зануляется и мерцание прекращается
}
if ((*led == 1) && (*press == 1))// Если горит первый светодиод и третья кнопка была нажата 1 раз, то
{
    *(uint32_t *)(0x40020000UL + 0x18UL) = 0x200000;//Выключить первый светодиод подключенный к PA5
    for (uint32_t i = 0; i<200000;i++){}//Максимальная задержка для имитации медленного мигания        
    *(uint32_t *)(0x40020000UL + 0x18UL) = 0x20;//Включить первый светодиод подключенный к PA5
    for (uint32_t i = 0; i<200000;i++){}//Мкасимальная задержка для имитации медленного мигания
}
if ((*led == 1) && (*press == 2))// Если горит первый светодиод и третья кнопка была нажата 2 раза, то
{
    *(uint32_t *)(0x40020000UL + 0x18UL) = 0x200000;//Выключить первый светодиод подключенный к PA5
    for (uint32_t i = 0; i<150000;i++){}//Средняя задержка для имитации среднего мигания         
    *(uint32_t *)(0x40020000UL + 0x18UL) = 0x20;//Включить первый светодиод подключенный к PA5
    for (uint32_t i = 0; i<150000;i++){}//Средняя задержка для имитации среднего мигания 
}
if ((*led == 1) && (*press == 3))// Если горит первый светодиод и третья кнопка была нажата 3 раза, то
{
    *(uint32_t *)(0x40020000UL + 0x18UL) = 0x200000;//Выключить первый светодиод подключенный к PA5
    for (uint32_t i = 0; i<100000;i++){}//Минимальная задержка для имитации быстрого мигания        
    *(uint32_t *)(0x40020000UL + 0x18UL) = 0x20;//Включить первый светодиод подключенный к PA5
    for (uint32_t i = 0; i<100000;i++){}//Минимальная задержка для имитации быстрого мигания 
}
if ((*led == 2) && (*press == 1))// Если горит второй светодиод и третья кнопка была нажата 1 раз, то
{
    *(uint32_t *)(0x40020000UL + 0x18UL) = 0x10000;//Выключить второй светодиод подключенный к PA0
    for (uint32_t i = 0; i<200000;i++){}//Максимальная задержка для имитации медленного мигания         
    *(uint32_t *)(0x40020000UL + 0x18UL) = 0x1;//Включить второй светодиод подключенный к PA0
    for (uint32_t i = 0; i<200000;i++){}//Максимальная задержка для имитации медленного мигания 
}
if ((*led == 2) && (*press == 2))// Если горит второй светодиод и третья кнопка была нажата 2 раза, то
{
    *(uint32_t *)(0x40020000UL + 0x18UL) = 0x10000;//Выключить второй светодиод подключенный к PA0
    for (uint32_t i = 0; i<150000;i++){}//Средняя задержка для имитации среднего мигания          
    *(uint32_t *)(0x40020000UL + 0x18UL) = 0x1;//Включить второй светодиод подключенный к PA0
    for (uint32_t i = 0; i<150000;i++){}//Средняя задержка для имитации среднего мигания  
}
if ((*led == 2) && (*press == 3))// Если горит второй светодиод и третья кнопка была нажата 3 раза, то
{
    *(uint32_t *)(0x40020000UL + 0x18UL) = 0x10000;//Выключить второй светодиод подключенный к PA0
    for (uint32_t i = 0; i<100000;i++){}//Минимальная задержка для имитации быстрого мигания          
    *(uint32_t *)(0x40020000UL + 0x18UL) = 0x1;//Включить второй светодиод подключенный к PA0
    for (uint32_t i = 0; i<100000;i++){}//Минимальная задержка для имитации быстрого мигания  
}
if ((*led == 3) && (*press == 1))// Если горит третий светодиод и третья кнопка была нажата 1 раз, то
{
    *(uint32_t *)(0x40020400UL + 0x18UL) = 0x10000;//Выключить третий светодиод подключенный к PB0
    for (uint32_t i = 0; i<200000;i++){}//Максимальная задержка для имитации медленного мигания         
    *(uint32_t *)(0x40020400UL + 0x18UL) = 0x1;//Включить третий светодиод подключенный к PB0
    for (uint32_t i = 0; i<200000;i++){}//Максимальная задержка для имитации медленного мигания 
}
if ((*led == 3) && (*press == 2))// Если горит третий светодиод и третья кнопка была нажата 2 раза, то
{
    *(uint32_t *)(0x40020400UL + 0x18UL) = 0x10000;//Выключить третий светодиод подключенный к PB0
    for (uint32_t i = 0; i<150000;i++){}//Средняя задержка для имитации среднего мигания        
    *(uint32_t *)(0x40020400UL + 0x18UL) = 0x1;//Включить третий светодиод подключенный к PB0
    for (uint32_t i = 0; i<150000;i++){}//Средняя задержка для имитации среднего мигания
}
if ((*led == 3) && (*press == 3))// Если горит третий светодиод и третья кнопка была нажата 3 раза, то
{
    *(uint32_t *)(0x40020400UL + 0x18UL) = 0x10000;//Выключить третий светодиод подключенный к PB0
    for (uint32_t i = 0; i<100000;i++){}//Минимальная задержка для имитации быстрого мигания        
    *(uint32_t *)(0x40020400UL + 0x18UL) = 0x1;//Включить третий светодиод подключенный к PB0
    for (uint32_t i = 0; i<100000;i++){}//Минимальная задержка для имитации быстрого мигания
}
if ((*led == 4) && (*press == 1))// Если горит четвертый светодиод и третья кнопка была нажата 1 раз, то
{
    *(uint32_t *)(0x40020400UL + 0x18UL) = 0x20000;//Выключить четвертый светодиод подключенный к PB1
    for (uint32_t i = 0; i<200000;i++){}//Максимальная задержка для имитации медленного мигания         
    *(uint32_t *)(0x40020400UL + 0x18UL) = 0x2;//Включить четвертый светодиод подключенный к PB1
    for (uint32_t i = 0; i<200000;i++){}//Максимальная задержка для имитации медленного мигания 
}
if ((*led == 4) && (*press == 2))// Если горит четвертый светодиод и третья кнопка была нажата 2 раза, то
{
    *(uint32_t *)(0x40020400UL + 0x18UL) = 0x20000;//Выключить четвертый светодиод подключенный к PB1
    for (uint32_t i = 0; i<150000;i++){}//Средняя задержка для имитации среднего мигания        
    *(uint32_t *)(0x40020400UL + 0x18UL) = 0x2;//Включить четвертый светодиод подключенный к PB1
    for (uint32_t i = 0; i<150000;i++){}//Средняя задержка для имитации среднего мигания
}
if ((*led == 4) && (*press == 3))// Если горит четвертый светодиод и третья кнопка была нажата 3 раза, то
{
    *(uint32_t *)(0x40020400UL + 0x18UL) = 0x20000;//Выключить четвертый светодиод подключенный к PB1
    for (uint32_t i = 0; i<100000;i++){}//Минимальная задержка для имитации быстрого мигания        
    *(uint32_t *)(0x40020400UL + 0x18UL) = 0x2;//Включить четвертый светодиод подключенный к PB1
    for (uint32_t i = 0; i<100000;i++){}//Минимальная задержка для имитации быстрого мигания
}
if ((*led == 5) && (*press == 1))// Если горит пятый светодиод и третья кнопка была нажата 1 раз, то
{
   *(uint32_t *)(0x40020800UL + 0x18UL) = 0x1000000;//Выключить пятый светодиод подключенный к PС8
    for (uint32_t i = 0; i<200000;i++){}//Максимальная задержка для имитации медленного мигания         
    *(uint32_t *)(0x40020800UL + 0x18UL) = 0x100;//Включить пятый светодиод подключенный к PС8
    for (uint32_t i = 0; i<200000;i++){}//Максимальная задержка для имитации медленного мигания 
}
if ((*led == 5) && (*press == 2))// Если горит пятый светодиод и третья кнопка была нажата 2 раза, то
{
   *(uint32_t *)(0x40020800UL + 0x18UL) = 0x1000000;//Выключить пятый светодиод подключенный к PС8
    for (uint32_t i = 0; i<150000;i++){}//Средняя задержка для имитации среднего мигания        
    *(uint32_t *)(0x40020800UL + 0x18UL) = 0x100;//Включить пятый светодиод подключенный к PС8
    for (uint32_t i = 0; i<150000;i++){}//Средняя задержка для имитации среднего мигания
}
if ((*led == 5) && (*press == 3))// Если горит пятый светодиод и третья кнопка была нажата 3 раза, то
{
   *(uint32_t *)(0x40020800UL + 0x18UL) = 0x1000000;//Выключить пятый светодиод подключенный к PС8
    for (uint32_t i = 0; i<100000;i++){}//Минимальная задержка для имитации быстрого мигания        
    *(uint32_t *)(0x40020800UL + 0x18UL) = 0x100;//Включить пятый светодиод подключенный к PС8
    for (uint32_t i = 0; i<100000;i++){}//Минимальная задержка для имитации быстрого мигания
}
if ((*led == 6) && (*press == 1))// Если горит шестой светодиод и третья кнопка была нажата 1 раз, то
{
   *(uint32_t *)(0x40020800UL + 0x18UL) = 0x400000;//Выключить шесстой светодиод подключенный к PС6
    for (uint32_t i = 0; i<200000;i++){}//Максимальная задержка для имитации медленного мигания         
    *(uint32_t *)(0x40020800UL + 0x18UL) = 0x40;//Включить шесстой светодиод подключенный к PС6
    for (uint32_t i = 0; i<200000;i++){}//Максимальная задержка для имитации медленного мигания 
}
if ((*led == 6) && (*press == 2))// Если горит шестой светодиод и третья кнопка была нажата 2 раза, то
{
   *(uint32_t *)(0x40020800UL + 0x18UL) = 0x400000;//Выключить шесстой светодиод подключенный к PС6
    for (uint32_t i = 0; i<150000;i++){}//Средняя задержка для имитации среднего мигания        
    *(uint32_t *)(0x40020800UL + 0x18UL) = 0x40;//Включить шесстой светодиод подключенный к PС6
    for (uint32_t i = 0; i<150000;i++){}//Средняя задержка для имитации среднего мигания
}
if ((*led == 6) && (*press == 3))// Если горит шестой светодиод и третья кнопка была нажата 3 раза, то
{
   *(uint32_t *)(0x40020800UL + 0x18UL) = 0x400000;//Выключить шесстой светодиод подключенный к PС6
    for (uint32_t i = 0; i<100000;i++){}//Минимальная задержка для имитации быстрого мигания        
    *(uint32_t *)(0x40020800UL + 0x18UL) = 0x40;//Включить шесстой светодиод подключенный к PС6
    for (uint32_t i = 0; i<100000;i++){}//Минимальная задержка для имитации быстрого мигания
}
}
