#include "init_lab2.h"

volatile uint8_t Last_state_but1 = 0;                                                           // Переменная хранящая предыдущее состояниен кнопки №1
volatile uint8_t Last_state_but2 = 0;                                                           // Переменная хранящая предыдущее состояниен кнопки №2
volatile uint32_t Hold_time_but1 = 0;                                                           // Переменная хранящая время нажатия кнопки №1
volatile uint32_t Hold_time_but2 = 0;                                                           // Переменная хранящая время нажатия кнопки №2

extern uint8_t led_en;                                                                          // Переменная хранящая сколько светодиодов включено
extern uint8_t num_led_blink;                                                                   // Переменная хранящая номер светодиода, частота которого настраивается
extern uint32_t GlobalTickCount;                                                                // Таймер
extern uint8_t blink[6][2];                                                                     // Матрица для хранения номера диапозона частоты и номера самой частоты мигания лампочек

/*Так как прерывание для кнопок происходит и по нарастанию и по спаду необходимо фиксировать время начала фронта
и по второму прерыванию (когда кнопка отпускается) сравнивать время между нажатием и отпусканием кнопки и в зависимости
от этого времени менять соответствующую переменную*/

void EXTI15_10_IRQHandler(void)                                                                 // Функция обработчик прерывания по кнопкам PC12 и PC13
{
    
    if (READ_BIT(EXTI->PR, EXTI_PR_PR12))                                                       // Обработка прерывания кнопки PC12 (первая кнопка)
    {
        static uint32_t last_time1 = 0;                                                         // Переменная хранящая время изменения состояния кнопки
        if ((GlobalTickCount - last_time1) > 50)                                                // Избавление от дребезга кнопки (50 мс)
        {
            uint8_t Current_state_but1 = (READ_BIT(GPIOC->IDR, GPIO_IDR_ID12) != 0);            // Переменная хранящая состояние кнопки
            
            if (Current_state_but1 == 1 && Last_state_but1 == 0)                                // Если сейчас кнопка нажата, а ранее не была нажата меняем состояние кнопки, то перезаписываем последнее состояние кнопки
            {
                Last_state_but1 = 1;
            }
            else if (Current_state_but1 == 0 && Last_state_but1 == 1)                           // Если сейчас кнопка не нажата, а ранее была нажата, то перезаписываем последнее состояние кнопки и в зависимости от времени нажатия выполняем действие
            {
                Last_state_but1 = 0;
                if (Hold_time_but1 < 2000)                                                      // Если кнопка была нажата менее 2 секунд, меняем частоту мигания (короткое нажатие)
                {
                    blink[num_led_blink][1] = (blink[num_led_blink][1] + 1) % 3;
                }
                else                                                                            // Иначе меняем количество включенных кнопок (длительное нажатие)
                {
                    led_en = (led_en + 1) % 7;                                                  
                }
                
                Hold_time_but1 = 0;                                                             // Производим сброс переменной хранящей время нажатия кнопки
            }
            
            last_time1 = GlobalTickCount;                                                       // Обновляем значение переменной для борьбы с дребезгом
        }
        SET_BIT(EXTI->PR, EXTI_PR_PR12);                                                        // Очищаем флаг прерывания на PC12                                                     
    }



    if (READ_BIT(EXTI->PR, EXTI_PR_PR13))                                                       // Обработка прерывания кнопки PC13 (вторая кнопка)
    {
        static uint32_t last_time2 = 0;                                                         // Переменная хранящая время изменения состояния кнопки                
        if ((GlobalTickCount - last_time2) > 50)                                                // Избавление от дребезга кнопки (50 мс)
        {
            uint8_t Current_state_but2 = (READ_BIT(GPIOC->IDR, GPIO_IDR_ID13) != 0);            // Переменная хранящая состояние кнопки

            if (Current_state_but2 == 1 && Last_state_but2 == 0)                                // Если сейчас кнопка нажата, а ранее не была нажата меняем состояние кнопки, то перезаписываем последнее состояние кнопки
            {
                Last_state_but2 = 1;
            }
            else if (Current_state_but2 == 0 && Last_state_but2 == 1)                           // Если сейчас кнопка не нажата, а ранее была нажата, то перезаписываем последнее состояние кнопки и в зависимости от времени нажатия выполняем действие
            {
                Last_state_but2 = 0;
                
                if (Hold_time_but2 < 2000)                                                      // Если кнопка была нажата менее 2 секунд, меняем диапозон частот мигания (короткое нажатие)
                {
                    blink[num_led_blink][0] = (blink[num_led_blink][0] + 1) % 3;
                }
                else                                                                            // Иначе меняем светодиод для которого производится настройка (длительное нажатие)
                {
                    num_led_blink = (num_led_blink + 1) % 6;
                }
                
                Hold_time_but2 = 0;                                                             // Производим сброс переменной хранящей время нажатия кнопки
            }
            
            last_time2 = GlobalTickCount;                                                       // Обновляем значение переменной для борьбы с дребезгом
        }
        
        SET_BIT(EXTI->PR, EXTI_PR_PR13);                                                        // Очищаем флаг прерывания на PC13 
    }
}



void SysTick_Handler(void)                                                                      // Обработчик прерывания системного таймера
{
    GlobalTickCount++;                                                                          // Увеличивает счетчик (основной таймер)
    
    if (Last_state_but1)                                                                        // Если кнопка №1 нажата, происходит увеличение переменной для борьбы с дребезгом
    {
        Hold_time_but1++;
    }
    
    if (Last_state_but2)                                                                        // Если кнопка №2 нажата, происходит увеличение переменной для борьбы с дребезгом
    {
        Hold_time_but2++;
    }
}