

//  int main(void)
//  {
// //     // ======================================================
// //     // 1. Включение тактирования GPIOB (бит1), GPIOC (бит2), в конце 0...00000110 = 0x06
//      *(uint32_t *)(0x40023800UL + 0x30UL) |= 0x06UL;

//     // // ======================================================
//     // // 2. PВ12, PB5, PB8 — подключение светодиодов на выход - Output mode
//     // // MODER: каждые 2 бита = режим
//     // // PB8  = биты 16:17   → 01 : маска 0x010000
//     // // PB5  = биты 10:11 → 01 : маска 0x0400
//     // // PB12 = биты 24:25 → 01 : маска 0x01000000
//     *(uint32_t *)(0x40020400UL + 0x00UL) |= 0x010000UL;
//     *(uint32_t *)(0x40020400UL + 0x00UL) |= 0x0400UL;
//     *(uint32_t *)(0x40020400UL + 0x00UL) |= 0x01000000UL;

//     // // OTYPER: все пины — push-pull (бит = 0)
//     // // PB8  = бит 8 → 0 : маска
//     // // PB5  = бит 5 → 0 : маска 0x20
//     // // PB12 = бит 12 → 0 : маска 0x1000
//     *(uint32_t *)(0x40020400UL + 0x04UL) &= ~(0x0100UL);
//     *(uint32_t *)(0x40020400UL + 0x04UL) &= ~(0x20UL);
//     *(uint32_t *)(0x40020400UL + 0x04UL) &= ~(0x1000UL);

//     // // OSPEEDR: medium speed - средняя скорость → 01
//     // // PB8  = биты 16:17 → 01 : маска 0x010000
//     // // PB5  = биты 10:11 → 01 : маска 0x0400
//     // // PB12 = биты 24:25 → 01 : маска 0x01000000
//     *(uint32_t *)(0x40020400UL + 0x08UL) |= 0x010000UL;
//     *(uint32_t *)(0x40020400UL + 0x08UL) |= 0x0400UL;
//     *(uint32_t *)(0x40020400UL + 0x08UL) |= 0x01000000UL;

//     // // PUPDR: без подтяжек → 00
//     // // PB8  = биты 16:17 → 00 : маска 0x030000
//     // // PB5  = биты 10:11 → 00 : маска 0x0C00
//     // // PB12 = биты 24:25 → 00 : маска 0x03000000
//     *(uint32_t *)(0x40020400UL + 0x0CUL) &= ~(0x030000UL);
//     *(uint32_t *)(0x40020400UL + 0x0CUL) &= ~(0x0C00UL);
//     *(uint32_t *)(0x40020400UL + 0x0CUL) &= ~(0x03000000UL);

//     // // ======================================================
//     // // 3. Кнопка 1 - PC7 — подключение на вход - Input mode
//     // // PC7 = биты 14:15 → 00 : маска 0xC000
//     *(uint32_t *)(0x40020800UL + 0x00UL) &= ~(0xC000UL);

//     // // PUPDR: подтяжка Кнопки 1 → Pull-up
//     // // PC7 = биты 14:15 → 01 : маска 0x4000
//     *(uint32_t *)(0x40020800UL + 0x0CUL) |= 0x4000UL;

//     // // ======================================================
//     // // 4. Кнопка 2 - PC6 — подключение на вход - Input mode
//     // // PC6 = биты 12:13 → 00 : маска
//     *(uint32_t *)(0x40020800UL + 0x00UL) &= ~(0x3000UL);

//     // // PUPDR: подтяжка Кнопки 2 → Pull-up
//     // // PC6 = биты 12:13 → 01 : маска 0x1000
//     // // ======================================================
//     *(uint32_t *)(0x40020800UL + 0x0CUL) |= 0x1000UL;

#include "init.h"
#include <stdint.h>

uint8_t mode = 0; // 0 = включаем, 1 = выключаем
uint8_t step = 0; // шаг
uint8_t But_on1 = 0;
uint8_t But_on2 = 0;

int main(void)
{
    GPIO_Init();

    uint8_t prev_btn1 = 1;
    uint8_t prev_btn2 = 1;

    uint32_t Filter1 = 0;
    uint32_t Filter2 = 0;

    while (1)
    {
        // Фильтр от дребезга сигнала кнопки 2
        if (READ_BUT_2)
        {
            Filter2 = 1000;
            But_on2 = 1;
        }
        else if (Filter2 == 0)
        {
            But_on2 = 0;
        }
        else if (Filter2 > 0)
        {
            Filter2 = Filter2 - 1;
        }

        uint8_t btn2 = But_on2;

        if (prev_btn2 == 1 && btn2 == 0)
        {
            mode ^= 1; // переключить режим
            step = 0;  // начать с начала при смене режима
        }
        prev_btn2 = btn2;

        // Фильтр от дребезга сигнала кнопки 1
        if (READ_BUT_1)
        {
            Filter1 = 1000;
            But_on1 = 1;
        }
        else if (Filter1 == 0)
        {
            But_on1 = 0;
        }
        else if (Filter1 > 0)
        {
            Filter1 = Filter1 - 1;
        }
        // Кнопка 1 (PC7) — действие - включение светодиодов и наоборот
        uint8_t btn1 = But_on1;
        if (prev_btn1 == 1 && btn1 == 0)
        {
            // ===== включение =====
            if (mode == 0)
            {
                if (step == 0)
                    GPIOB_BSRR = LED_1_TURN_ON;
                else if (step == 1)
                    GPIOB_BSRR = LED_2_TURN_ON;
                else if (step == 2)
                    GPIOB_BSRR = LED_3_TURN_ON;
                if (step < 3)
                    step++;
            }
            // ===== выключение =====
            else
            {
                if (step == 0)
                    GPIOB_BSRR = LED_1_TURN_OFF;
                else if (step == 1)
                    GPIOB_BSRR = LED_2_TURN_OFF;
                else if (step == 2)
                    GPIOB_BSRR = LED_3_TURN_OFF;
                if (step < 3)
                    step++;
            }
        }
        prev_btn1 = btn1;
    }
}