int main(void)
{ /*
    (uint32_t *)(0x40023800UL + 0x30UL) |= 0x02;
    (uint32_t *)(0x40020400UL + 0x00UL) |= 0x4000;
    *(uint32_t*)(0x40020400UL + 0x04UL) |= 0x00; // режим управления регистром (мосфет!/ либо подтягивающие)
    *(uint32_t*)(0x40020400UL + 0x08UL) |= 0x4000; // настройка скорости порта
    if((*(uint32_t*)(0x40020400UL + 0x10UL) & 0x80UL) != 0) // проверка лампочки
    *(uint32_t*)(0x40020400UL + 0x18UL) |= 0x800000; // bit reset
    *(uint32_t*)(0x40020400UL + 0x18UL) |= 0x80; // bit set

    */
    *(uint32_t*)(0x40023800UL + 0x30UL) |= 0x02; //Включение тактирования порта GPIOB
    *(uint32_t*)(0x40020400UL + 0x00UL) |= 0x4000; //Настройка работы 7-го пина GPIOB в режиме вывода сигнала (Output mode)
    *(uint32_t*)(0x40020400UL + 0x04UL) |= 0x00; //Настройка на Push-Pull работу 7-го пина GPIOB (Output Push-Pull)
    *(uint32_t*)(0x40020400UL + 0x08UL) |= 0x4000; //Настройка скорости работы 7-го пина GPIOB на среднюю
    *(uint32_t*)(0x40020400UL + 0x0CUL) |= 0x00; //Отключение PU/PD резисторов для 7-го пина GPIOB
    while (1)
    {
    }
}