#pragma once

#include "stm32f4xx.h"

#include "BoardInit.h"
#include "PinInit.h"

#include "task1.h"


// ------------------ MAIN ------------------
void main(void){
    // ----------------------------------------------------------------
    // ------------------ включаем тактирование -----------------------
    // ----------------------------------------------------------------
    enableClockC();
    enableClockD();
    enableClockE();

    // ----------------------------------------------------------------
    // ------------------ Настраиваем пины ----------------------------
    // ----------------------------------------------------------------
    pcOutput(PC1);

    pdOutput(PD1);

    peOutput(PE5);

    pc_SetInput(PC11);
    pc_SetInput(PC12);

    // Задание 1
    // GenRow();

    // Доп задание
    GenFreq();
}
